In [2]:
import pandas as pd

In [ ]:
Two-dimensional size-mutable, potentially heterogeneous tabular data
structure with labeled axes (rows and columns)

In [3]:
import numpy as np

In [4]:
arr = np.array([[1, 2, 3], [4, 5, 6]]) #2 d numpy array
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [5]:
arr = np.array([(1, 2, 3), (4, 5, 6)]) #2 d numpy array
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [6]:
arr = np.array([[1, 2, 3], [4, 5, 6]]) #2 d numpy array 
df = pd.DataFrame(arr)  # create a data frame from the numpy array
                        # Pandas automatically gives them indexes (or 0,1,2 are also labels)
    
 #df = pd.DataFrame(arr),columns=['col 1','col 2','col 3']

In [7]:
df        # first array or vector as 1st row in data frame, second vector as second row

   0  1  2
0  1  2  3
1  4  5  6

In [20]:
df[0]

0    1
1    4
Name: 0, dtype: int32

In [8]:
df[1]

0    2
1    5
Name: 1, dtype: int32

In [9]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [10]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [11]:
arr = np.array([[1, 2, 3], [4, 5, 6]]) #2 d numpy array 
df = pd.DataFrame(arr,columns=['col1','col2','col3'],index=['r1','r2'])  #manual labeling
df

    col1  col2  col3
r1     1     2     3
r2     4     5     6

In [12]:
 df['col3']# acess the elements by using indices i.e acces the contents of the third column

r1    3
r2    6
Name: col3, dtype: int32

In [13]:
df.columns  # gives the names of columns in the form of range that pandas automatically assign

Index(['col1', 'col2', 'col3'], dtype='object')

In [14]:
df['col2']  # columns can be labelled manually

r1    2
r2    5
Name: col2, dtype: int32

In [15]:
s1 = pd.Series(np.random.randn(5),index=['A','B','C','D','E']) # series is one dimensional data structure,5 random numbers from numpy

In [27]:
s1

A    1.968295
B    0.235175
C    1.041845
D   -0.600387
E   -0.497146
dtype: float64

In [23]:
s2 = pd.Series(np.random.randn(5),index=['A','B','C','D','E'])

In [24]:
s2

A   -0.123859
B   -0.533384
C   -1.709159
D    1.311607
E   -0.434962
dtype: float64

In [31]:
#axis : {0/'index', 1/'columns'}, default 0  The axis to concatenate along
df = pd.concat([s1, s2],axis=1)
df

          0         1
A -0.439239 -0.123859
B  0.144203 -0.533384
C  1.561591 -1.709159
D -1.328464  1.311607
E -0.672147 -0.434962

In [32]:
df[1]['E']

-0.43496156582130313

pd.concat([s1, s2], axis=1) joins the two Series side by side (columns).

reset_index() moves the original index (A, B, C, D, E) into a new column called "index" and assigns a new default integer index (0, 1, 2, 3, 4).

In [33]:
#axis : {0/'index', 1/'columns'}, default 0  The axis to concatenate along
df = pd.concat([s1, s2],axis=1).reset_index()

In [34]:
df

  index         0         1
0     A -0.439239 -0.123859
1     B  0.144203 -0.533384
2     C  1.561591 -1.709159
3     D -1.328464  1.311607
4     E -0.672147 -0.434962

In [35]:
df[1][0]

-0.12385923918840228

axis=1 → concat side-by-side (columns).

reset_index(drop=True) → removes the old index without adding it as a new column.

Now you will get a DataFrame with integer indexes (0, 1, 2, 3, 4) and no "index" column.

In [36]:
df = pd.concat([s1, s2], axis=1).reset_index(drop=True)
df

          0         1
0 -0.439239 -0.123859
1  0.144203 -0.533384
2  1.561591 -1.709159
3 -1.328464  1.311607
4 -0.672147 -0.434962

In [37]:
dp=s2.to_frame()
print(dp)
type(dp)

          0
A  1.404449
B -1.133963
C -1.873227
D  0.448066
E -0.151049

pandas.core.frame.DataFrame

In [37]:
my_df = pd.DataFrame(np.random.randn(25).reshape((5,5)),index=['a','b','c','d','e'],columns=['c1','c2','c3','c4','c5'])

In [38]:
my_df

         c1        c2        c3        c4        c5
a  0.180907 -0.634018  0.583386 -0.458330 -0.850565
b  1.759507  0.100223 -0.128512 -0.943770  0.289280
c  0.966118  0.923943 -0.947233  1.461177  0.545747
d  0.431565  0.065300  1.034868  0.654516  0.543274
e -0.705384  0.429243 -0.430414  0.851109  0.476680

In [ ]:
Drop specified labels from rows or columns.

Remove rows or columns by specifying label names and corresponding
axis, or by specifying directly index or column names.

Drop the column c2.

Work on columns because axis=1.

Do not change my_df permanently — instead, return a new DataFrame.

my_df will remain unchanged unless you assign the result to a new variable.

In [48]:
my_df.drop('c2',axis=1,inplace=False)

         c1        c3        c4        c5
a  0.582299 -0.706074  0.919884 -0.208221
b  1.109036  0.859343 -0.040539  0.777285
c -0.321558 -0.252036  1.176383  1.260723
d -0.649170  1.409984  0.284063  0.805140
e -0.356754  0.052488 -0.369870  0.406328

In [49]:
my_df

         c1        c2        c3        c4        c5
a  0.582299 -0.465746 -0.706074  0.919884 -0.208221
b  1.109036 -0.556409  0.859343 -0.040539  0.777285
c -0.321558  0.827996 -0.252036  1.176383  1.260723
d -0.649170 -0.001465  1.409984  0.284063  0.805140
e -0.356754 -1.673552  0.052488 -0.369870  0.406328

In [39]:
my_df.drop('c2',axis=1,inplace=True)

In [43]:
my_df

       col1      col2      col3      col4
a  0.180907  0.583386 -0.458330 -0.850565
b  1.759507 -0.128512 -0.943770  0.289280
c  0.966118 -0.947233  1.461177  0.545747
d  0.431565  1.034868  0.654516  0.543274
e -0.705384 -0.430414  0.851109  0.476680

In [46]:
my_df.columns = ['col1', 'col2', 'col3', 'col4']
my_df.index=['rol1', 'rol2', 'rol3', 'rol4', '5']

In [42]:
my_df

       col1      col2      col3      col4
a  0.180907  0.583386 -0.458330 -0.850565
b  1.759507 -0.128512 -0.943770  0.289280
c  0.966118 -0.947233  1.461177  0.545747
d  0.431565  1.034868  0.654516  0.543274
e -0.705384 -0.430414  0.851109  0.476680

In [56]:
my_df.loc['a']['col2'] # accessing elements of dataframe thorugh labels of rows and cols

-0.7060742187474643

In [57]:
my_df.iloc[0][1] # integer based indexing to access elements of dataframe

#Purely integer-location based indexing for selection by position.

-0.7060742187474643

In [58]:
my_df.iloc[0,1]

-0.7060742187474643

In [60]:
my_df['col1']['a']

0.5822986346381396

In [61]:
my_df['col1'][0]

0.5822986346381396

In [ ]:
my_df

In [63]:
my_df

       col1      col2      col3      col4
a  0.582299 -0.706074  0.919884 -0.208221
b  1.109036  0.859343 -0.040539  0.777285
c -0.321558 -0.252036  1.176383  1.260723
d -0.649170  1.409984  0.284063  0.805140
e -0.356754  0.052488 -0.369870  0.406328

In [80]:
my_df.sort_values(by=['col1','col4']) #axis : {0 or 'index', 1 or 'columns'}, default 0 Axis to be sorted
# sorint along rowwise by defualt

       col1      col2      col3      col4
d -0.649170  1.409984  0.284063  0.805140
e -0.356754  0.052488 -0.369870  0.406328
c -0.321558 -0.252036  1.176383  1.260723
a  0.582299 -0.706074  0.919884 -0.208221
b  1.109036  0.859343 -0.040539  0.777285

In [84]:
my_df.sort_values(by='col1')# sorting along columnwise

       col2      col4      col1      col3
a -0.706074 -0.208221  0.582299  0.919884
b  0.859343  0.777285  1.109036 -0.040539
c -0.252036  1.260723 -0.321558  1.176383
d  1.409984  0.805140 -0.649170  0.284063
e  0.052488  0.406328 -0.356754 -0.369870

In [87]:
my_df.sort_values(by='b',axis=1)# sorting along rowsise

       col2      col4      col1      col3
a -0.706074 -0.208221  0.582299  0.919884
b  0.859343  0.777285  1.109036 -0.040539
c -0.252036  1.260723 -0.321558  1.176383
d  1.409984  0.805140 -0.649170  0.284063
e  0.052488  0.406328 -0.356754 -0.369870

In [70]:
data = {'first_name': ['Noureddin', 'Josef', 'Mike', 'Ali', 'Luke'],
        'last_name': ['Sadawi', 'Baker', 'Brooks', 'Shah', 'Brown'],
        'year': [2015, 2009, 2013, 2016, 2014],
        'score': [422, 322, 233, 223, 401]
        }
df = pd.DataFrame(data, index = ['Tripoli', 'Birmingham', 'London', 'Islamabad', 'New York'])
df

           first_name last_name  year  score
Tripoli     Noureddin    Sadawi  2015    422
Birmingham      Josef     Baker  2009    322
London           Mike    Brooks  2013    233
Islamabad         Ali      Shah  2016    223
New York         Luke     Brown  2014    401

In [71]:
df.sort_values(by='last_name', ascending=True) # by defult axis=0 for row, and axis=1 for column

           first_name last_name  year  score
Birmingham      Josef     Baker  2009    322
London           Mike    Brooks  2013    233
New York         Luke     Brown  2014    401
Tripoli     Noureddin    Sadawi  2015    422
Islamabad         Ali      Shah  2016    223

In [72]:
df.sort_values(by=['last_name','score'])

           first_name last_name  year  score
Birmingham      Josef     Baker  2009    322
London           Mike    Brooks  2013    233
New York         Luke     Brown  2014    401
Tripoli     Noureddin    Sadawi  2015    422
Islamabad         Ali      Shah  2016    223

In [73]:
m = df[df < 240]

In [74]:
m

           first_name last_name  year  score
Tripoli     Noureddin    Sadawi   NaN    NaN
Birmingham      Josef     Baker   NaN    NaN
London           Mike    Brooks   NaN  233.0
Islamabad         Ali      Shah   NaN  223.0
New York         Luke     Brown   NaN    NaN

In [76]:
m.dropna(how='all',axis=1,thresh=3)#Remove missing values.

#0, or 'index' : Drop rows which contain missing values.
#    * 1, or 'columns' : Drop columns which contain missing value.
#'any' : If any NA values are present, drop that row or column.
 #   * 'all' : If all values are NA, drop that row or column.
    # Keep columns with aleast 3 non-NA vlaues

           first_name last_name  score
Tripoli     Noureddin    Sadawi    NaN
Birmingham      Josef     Baker    NaN
London           Mike    Brooks  233.0
Islamabad         Ali      Shah  223.0
New York         Luke     Brown    NaN

In [77]:
m

           first_name last_name  year  score
Tripoli     Noureddin    Sadawi   NaN    NaN
Birmingham      Josef     Baker   NaN    NaN
London           Mike    Brooks   NaN  233.0
Islamabad         Ali      Shah   NaN  223.0
New York         Luke     Brown   NaN    NaN

In [78]:
m.fillna(1,inplace=True)

In [79]:
m

           first_name last_name  year  score
Tripoli     Noureddin    Sadawi   1.0    1.0
Birmingham      Josef     Baker   1.0    1.0
London           Mike    Brooks   1.0  233.0
Islamabad         Ali      Shah   1.0  223.0
New York         Luke     Brown   1.0    1.0